export const bankCodeMap = {
  '0004': 'KB국민은행',
  '0020': '우리은행',
  '0088': '신한은행',
  '0081': '하나은행',
  '0011': 'NH농협은행',
  '0270': '시티은행',
  '0089': '케이뱅크',
  '0230': 'SC제일은행',
  '0032': '부산은행',
  '0003': 'IBK기업은행',
  //추가
  '0002': 'KDB산업은행',
  '0007': '수협은행',
  //'0031': '대구은행',
  '0034': '광주은행',
  //'0035': '제주은행',
  //'0037': '전북은행',
  //'0039': '경남은행',
  '0045': '새마을금고',
  '0048': '신협은행',
  '0071': '우체국',
};

export function getBankName(bankCode) {
  return bankCodeMap[bankCode] || '알 수 없음';
}
